; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=171, out_folder=htg/blocksworld/training, instance_id=17, seed=2041, goal_proportion=0.03

(define (problem blocksworld-17)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 - object)
 (:init 
    (arm-empty)
    (clear b122)
    (on b122 b168)
    (on b168 b171)
    (on b171 b128)
    (on b128 b92)
    (on b92 b96)
    (on b96 b29)
    (on b29 b3)
    (on b3 b109)
    (on b109 b41)
    (on b41 b151)
    (on-table b151)
    (clear b39)
    (on b39 b33)
    (on b33 b81)
    (on b81 b145)
    (on-table b145)
    (clear b37)
    (on b37 b104)
    (on b104 b106)
    (on b106 b136)
    (on b136 b78)
    (on b78 b127)
    (on-table b127)
    (clear b107)
    (on b107 b13)
    (on b13 b1)
    (on-table b1)
    (clear b50)
    (on b50 b64)
    (on b64 b57)
    (on b57 b120)
    (on b120 b16)
    (on b16 b84)
    (on b84 b102)
    (on b102 b22)
    (on b22 b97)
    (on-table b97)
    (clear b90)
    (on-table b90)
    (clear b98)
    (on-table b98)
    (clear b156)
    (on b156 b162)
    (on b162 b24)
    (on b24 b117)
    (on-table b117)
    (clear b19)
    (on b19 b47)
    (on b47 b42)
    (on-table b42)
    (clear b6)
    (on b6 b20)
    (on b20 b54)
    (on b54 b157)
    (on b157 b73)
    (on b73 b153)
    (on b153 b112)
    (on b112 b85)
    (on b85 b32)
    (on b32 b30)
    (on b30 b141)
    (on-table b141)
    (clear b101)
    (on b101 b125)
    (on-table b125)
    (clear b111)
    (on-table b111)
    (clear b8)
    (on b8 b87)
    (on b87 b147)
    (on b147 b89)
    (on b89 b105)
    (on b105 b36)
    (on-table b36)
    (clear b61)
    (on b61 b5)
    (on-table b5)
    (clear b164)
    (on b164 b27)
    (on-table b27)
    (clear b130)
    (on-table b130)
    (clear b46)
    (on b46 b76)
    (on b76 b163)
    (on-table b163)
    (clear b93)
    (on b93 b23)
    (on b23 b160)
    (on-table b160)
    (clear b123)
    (on b123 b71)
    (on-table b71)
    (clear b26)
    (on b26 b55)
    (on b55 b86)
    (on b86 b154)
    (on b154 b82)
    (on b82 b72)
    (on b72 b44)
    (on-table b44)
    (clear b9)
    (on b9 b4)
    (on b4 b170)
    (on b170 b74)
    (on b74 b79)
    (on-table b79)
    (clear b121)
    (on b121 b56)
    (on b56 b165)
    (on b165 b126)
    (on b126 b152)
    (on b152 b75)
    (on b75 b15)
    (on b15 b110)
    (on b110 b119)
    (on b119 b66)
    (on b66 b18)
    (on-table b18)
    (clear b169)
    (on b169 b69)
    (on b69 b114)
    (on b114 b144)
    (on b144 b94)
    (on-table b94)
    (clear b43)
    (on-table b43)
    (clear b10)
    (on b10 b25)
    (on b25 b59)
    (on-table b59)
    (clear b142)
    (on b142 b116)
    (on b116 b138)
    (on b138 b140)
    (on b140 b134)
    (on-table b134)
    (clear b133)
    (on b133 b167)
    (on-table b167)
    (clear b45)
    (on-table b45)
    (clear b95)
    (on-table b95)
    (clear b7)
    (on b7 b99)
    (on b99 b131)
    (on b131 b14)
    (on b14 b40)
    (on b40 b124)
    (on b124 b166)
    (on b166 b28)
    (on b28 b17)
    (on-table b17)
    (clear b150)
    (on b150 b2)
    (on-table b2)
    (clear b155)
    (on b155 b58)
    (on-table b58)
    (clear b51)
    (on-table b51)
    (clear b12)
    (on b12 b159)
    (on-table b159)
    (clear b161)
    (on b161 b52)
    (on b52 b91)
    (on b91 b48)
    (on b48 b60)
    (on b60 b38)
    (on b38 b108)
    (on-table b108)
    (clear b132)
    (on b132 b137)
    (on b137 b88)
    (on b88 b68)
    (on-table b68)
    (clear b62)
    (on-table b62)
    (clear b49)
    (on b49 b135)
    (on b135 b53)
    (on b53 b158)
    (on b158 b146)
    (on b146 b139)
    (on b139 b70)
    (on b70 b113)
    (on-table b113)
    (clear b129)
    (on b129 b100)
    (on-table b100)
    (clear b67)
    (on b67 b148)
    (on b148 b31)
    (on-table b31)
    (clear b77)
    (on b77 b83)
    (on-table b83)
    (clear b103)
    (on b103 b65)
    (on b65 b35)
    (on b35 b143)
    (on b143 b21)
    (on-table b21)
    (clear b63)
    (on b63 b118)
    (on b118 b34)
    (on b34 b80)
    (on-table b80)
    (clear b149)
    (on b149 b115)
    (on b115 b11)
    (on-table b11))
 (:goal  (and 
    (clear b5)
    (on b5 b1)
    (on-table b1)
    (clear b2)
    (on b2 b3)
    (on b3 b4)
    (on-table b4))))

; plan
1. (unstack b107 b13)
   deleted: (on b107 b13) (clear b107) (arm-empty)
   added: (holding b107) (clear b13)
   goals met: 1 of 7
2. (putdown b107)
   deleted: (holding b107)
   added: (clear b107) (arm-empty) (on-table b107)
   goals met: 1 of 7
3. (unstack b122 b168)
   deleted: (on b122 b168) (clear b122) (arm-empty)
   added: (holding b122) (clear b168)
   goals met: 1 of 7
4. (putdown b122)
   deleted: (holding b122)
   added: (clear b122) (arm-empty) (on-table b122)
   goals met: 1 of 7
5. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 1 of 7
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 7
7. (unstack b150 b2)
   deleted: (on b150 b2) (clear b150) (arm-empty)
   added: (holding b150) (clear b2)
   goals met: 2 of 7
8. (putdown b150)
   deleted: (holding b150)
   added: (clear b150) (arm-empty) (on-table b150)
   goals met: 2 of 7
9. (unstack b168 b171)
   deleted: (on b168 b171) (clear b168) (arm-empty)
   added: (holding b168) (clear b171)
   goals met: 2 of 7
10. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 2 of 7
11. (unstack b171 b128)
   deleted: (on b171 b128) (clear b171) (arm-empty)
   added: (holding b171) (clear b128)
   goals met: 2 of 7
12. (putdown b171)
   deleted: (holding b171)
   added: (clear b171) (arm-empty) (on-table b171)
   goals met: 2 of 7
13. (unstack b128 b92)
   deleted: (on b128 b92) (clear b128) (arm-empty)
   added: (holding b128) (clear b92)
   goals met: 2 of 7
14. (putdown b128)
   deleted: (holding b128)
   added: (clear b128) (arm-empty) (on-table b128)
   goals met: 2 of 7
15. (unstack b61 b5)
   deleted: (on b61 b5) (clear b61) (arm-empty)
   added: (holding b61) (clear b5)
   goals met: 3 of 7
16. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 3 of 7
17. (unstack b9 b4)
   deleted: (on b9 b4) (clear b9) (arm-empty)
   added: (holding b9) (clear b4)
   goals met: 3 of 7
18. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 7
19. (unstack b4 b170)
   deleted: (on b4 b170) (clear b4) (arm-empty)
   added: (holding b4) (clear b170)
   goals met: 3 of 7
20. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 7
21. (unstack b92 b96)
   deleted: (on b92 b96) (clear b92) (arm-empty)
   added: (holding b92) (clear b96)
   goals met: 4 of 7
22. (putdown b92)
   deleted: (holding b92)
   added: (clear b92) (arm-empty) (on-table b92)
   goals met: 4 of 7
23. (unstack b96 b29)
   deleted: (on b96 b29) (clear b96) (arm-empty)
   added: (holding b96) (clear b29)
   goals met: 4 of 7
24. (putdown b96)
   deleted: (holding b96)
   added: (clear b96) (arm-empty) (on-table b96)
   goals met: 4 of 7
25. (unstack b29 b3)
   deleted: (on b29 b3) (clear b29) (arm-empty)
   added: (holding b29) (clear b3)
   goals met: 4 of 7
26. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 4 of 7
27. (unstack b3 b109)
   deleted: (on b3 b109) (clear b3) (arm-empty)
   added: (holding b3) (clear b109)
   goals met: 4 of 7
28. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 5 of 7
29. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 7
30. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 6 of 7
31. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 5 of 7
32. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 7 of 7
